Repository: bcblr1993/AetherRoute
Catalog: Sources/AetherRouteApp/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Use an ASCII domain suffix, IPv4 CIDR, or IPv6 CIDR. Wildcard domains such as *.example.com are normalized safely.
zh_hans: 可填写 ASCII 域名后缀、IPv4 CIDR 或 IPv6 CIDR。*.example.com 等通配域名会被安全规范化。

source: Use at least %lld characters. AetherRoute cannot recover this password.
zh_hans: 至少使用 %lld 个字符。AetherRoute 无法找回此密码。

source: Use TLS
zh_hans: 启用 TLS

source: Username
zh_hans: 用户名

source: Username (optional)
zh_hans: 用户名（可选）

source: Valid until %@
zh_hans: 有效期至 %@

source: Verified · updated %@
zh_hans: 已校验 · 更新于 %@

source: Verifying the network extension
zh_hans: 正在验证网络扩展

source: Version
zh_hans: 版本

source: Version %@
zh_hans: 版本 %@

source: Version %@ (%@)
zh_hans: 版本 %@（%@）

source: Version %@ (Build %@)
zh_hans: 版本 %@ (构建 %@)

source: View its license expression, source repository, and complete notice text.
zh_hans: 查看许可表达式、源代码仓库和完整声明文本。

source: Visibility
zh_hans: 可见范围

source: Wait for the current network operation to finish before changing profiles.
zh_hans: 请等待当前网络操作完成后再切换配置。

source: Wait while the normal network path is restored.
zh_hans: 正在恢复正常网络路径，请稍候。

source: Waiting for approval
zh_hans: 等待批准

source: Welcome to AetherRoute
zh_hans: 欢迎使用 AetherRoute

source: When you connect, traffic and DNS queries may be sent to the proxy and DNS services in your profile. Subscription updates contact your provider; routing rule updates contact public data sources after connection. These services may observe your IP address. Review and trust a provider before importing it.
zh_hans: 连接后，流量和 DNS 查询可能发送至配置中的代理和 DNS 服务。订阅更新会联系你的服务商；路由规则会在连接后从公开数据源更新。这些服务可能看到你的 IP 地址，请仅导入你信任的配置。

source: You can cancel safely while readiness checks are running.
zh_hans: 就绪检查期间可以安全取消。

source: You choose the route
zh_hans: 由你选择路由

source: Your Network Privacy
zh_hans: 你的网络隐私

source: Your selected services receive traffic
zh_hans: 你选择的服务会接收流量

source: Tunnel
zh_hans: 隧道

source: Reconnect
zh_hans: 重新连接

source: Routing Mode
zh_hans: 路由模式

source: The subscription will be downloaded and safely added to your profile library without interrupting your connection.
zh_hans: 订阅将被下载并安全添加到配置库中，不会中断当前连接。

source: Wait for current profile operations to finish before importing.
zh_hans: 请等待当前配置操作完成后再导入。

source: Profile imported into library.
zh_hans: 配置已导入至配置库。

source: Wait for current profile operations to finish before adding node.
zh_hans: 请等待当前配置操作完成后再添加节点。

source: Manual node created in library.
zh_hans: 手动节点已创建至配置库。

source: No profiles available to export.
zh_hans: 没有可供导出的配置。

source: Wait for current profile operations to finish before adding subscription.
zh_hans: 请等待当前配置操作完成后再添加订阅。

source: Subscription downloaded into library.
zh_hans: 订阅已下载并保存至配置库。

source: Subscription downloaded into library. %lld usable nodes imported; %lld invalid nodes skipped.
zh_hans: 订阅已下载并保存至配置库。已导入 %1$lld 个可用节点，跳过 %2$lld 个无效节点。

source: Appearance
zh_hans: 外观

source: Application theme
zh_hans: 应用主题

source: Light
zh_hans: 浅色

source: Dark
zh_hans: 深色

source: Theme changes apply immediately and are remembered next time.
zh_hans: 主题切换立即生效，下次启动时保留你的选择。

source: Select Node
zh_hans: 选择节点

source: Back
zh_hans: 返回

source: No nodes available
zh_hans: 暂无可用节点

source: Traffic · Last 30 seconds
zh_hans: 网络波形 · 最近 30 秒

source: Refresh: every 3 seconds
zh_hans: 刷新间隔：3 秒

source: Refresh: every 10 seconds
zh_hans: 刷新间隔：10 秒

source: Recovering network
zh_hans: 正在恢复网络

source: The tunnel remains active while the network recovers. You can disconnect at any time.
zh_hans: 隧道保持启用，正在等待网络恢复。你可以随时断开连接。

source: TCP reachability only; not verified through the node
zh_hans: 仅 TCP 可达性；未经该节点协议验证

source: Verified through the node's protocol handler
zh_hans: 已经该节点协议栈验证

source: All Actions
zh_hans: 全部动作

source: Hide Test
zh_hans: 收起测试

source: Test Route
zh_hans: 测试路由

source: Route Match Simulator
zh_hans: 路由匹配模拟器

source: Instant dry-run against active rules
zh_hans: 实时模拟规则命中路径

source: Enter a domain (e.g. github.com) or IP (e.g. 192.168.1.1)…
zh_hans: 输入域名（如 github.com）或 IP（如 192.168.1.1）…

source: Test
zh_hans: 测试

source: Matched Rule #%lld
zh_hans: 命中第 %lld 条规则

source: Locate
zh_hans: 定位

source: Filter criteria, targets, or kinds…
zh_hans: 搜索域名、IP、目标或类型…

source: Evaluation order (top to bottom)
zh_hans: 自上而下按序匹配

source: Any remaining traffic (Fallback)
zh_hans: 所有剩余流量（兜底）

source: Copy criteria
zh_hans: 复制匹配内容

source: Copy Criteria
zh_hans: 复制匹配内容

source: Test This Destination
zh_hans: 测试此项路由

source: Copy Full Rule
zh_hans: 复制完整规则

source: Copy Target Name
zh_hans: 复制出口名称

source: Cannot determine the route: runtime data or rules outside this preview are required.
zh_hans: 无法判定路由：需要运行时数据或预览范围以外的规则。

source: No preview rule matched. The runtime routing mode remains authoritative.
zh_hans: 未命中预览规则，实际路由以运行时模式为准。

source: Enter a valid domain, IP address, or URL.
zh_hans: 请输入有效的域名、IP 地址或 URL。

source: Disconnect Tunnel
zh_hans: 断开隧道连接

source: Disconnecting the tunnel will stop proxy routing and terminate all active connections.
zh_hans: 断开隧道将停止代理路由并终止所有活跃连接。

source: Auto Update
zh_hans: 自动更新

source: Auto-update interval updated.
zh_hans: 自动更新周期已更新。

source: Manual only
zh_hans: 仅手动

source: Every 6 Hours
zh_hans: 每 6 小时

source: Every 12 Hours
zh_hans: 每 12 小时

source: Every 24 Hours
zh_hans: 每 24 小时

source: Quick Test:
zh_hans: 快速测试：

source: No matching nodes
zh_hans: 未找到匹配节点

source: iCloud Profile Sync
zh_hans: iCloud 配置同步

source: End-to-end encrypted synchronization across your Mac and iPhone devices.
zh_hans: 在您的 Mac 与 iPhone 设备间实现端到端加密同步。

source: Enable iCloud Sync
zh_hans: 启用 iCloud 同步

source: Profiles are encrypted with AES-256-GCM before being stored in iCloud. The encryption key is protected by iCloud Keychain and synchronizes across devices with the same Apple ID.
zh_hans: 配置在存储至 iCloud 前均使用 AES-256-GCM 强加密。加密密钥受 iCloud 钥匙串保护，并在登录相同 Apple ID 的设备间安全同步。

source: Last Synced:
zh_hans: 上次同步时间：

source: Sync Now
zh_hans: 立即同步

source: Force Pull
zh_hans: 强制云端拉取

source: Force Push
zh_hans: 强制推送到云端

source: Done
zh_hans: 完成

source: iCloud Sync…
zh_hans: iCloud 同步…

source: Sync profiles from your iPhone or Mac.
zh_hans: 从您的 iPhone 或 Mac 设备同步配置。

source: Custom rules (Top priority)
zh_hans: 自定义规则 (最高优先级)

source: Custom routing rules
zh_hans: 自定义分流规则

source: Custom rules take absolute top priority. Direct IP-CIDR rules automatically bypass TUN kernel routing.
zh_hans: 自定义规则拥有最高优先级，且目标为 DIRECT 的 IP-CIDR 将自动在内核层绕过 TUN 网卡。

source: Add Rule
zh_hans: 添加规则

source: No custom rules configured
zh_hans: 暂未配置自定义规则

source: Verify rule
zh_hans: 验证规则

source: Edit rule
zh_hans: 编辑规则

source: Delete rule
zh_hans: 删除规则

source: Add Custom Routing Rule
zh_hans: 添加自定义分流规则

source: Edit Custom Routing Rule
zh_hans: 编辑自定义分流规则

source: Custom rules take top priority in traffic matching.
zh_hans: 自定义规则置于最顶端生效，且目标为直连的网段自动在内核层直连。

source: Rule kind
zh_hans: 规则种类

source: Match criteria / Target address
zh_hans: 匹配条件 / 目标地址

source: Action (Target)
zh_hans: 分流动作 (Target)

source: Specify proxy node or group name
zh_hans: 指定代理节点或策略组名称

source: e.g. PROXY, Node Select, Auto…
zh_hans: 例如 PROXY, 节点选择, 自动选择…

source: no-resolve (Skip DNS resolution and match by existing IP)
zh_hans: no-resolve (跳过 DNS 解析，直接根据已有 IP 判定)

source: Note (Optional)
zh_hans: 备注说明 (可选)

source: e.g. Tailscale node / local service
zh_hans: 例如: Tailscale 内网节点 / 本地私有服务

source: Clash format rule text
zh_hans: Clash 格式规则文本

source: e.g. DOMAIN-SUFFIX,baizhiedu.xin,DIRECT or IP-CIDR,100.64.0.0/10,DIRECT,no-resolve
zh_hans: 例如: DOMAIN-SUFFIX,baizhiedu.xin,DIRECT 或 IP-CIDR,100.64.0.0/10,DIRECT,no-resolve

source: e.g. Direct private subnet
zh_hans: 例如: 私有网段直连

source: Rule syntax is valid and active
zh_hans: 规则格式合法，可正常生效

source: Simulated match: %@ -> %@
zh_hans: 分流测试命中: %@ -> %@

source: Save rule
zh_hans: 保存规则

source: Rule validation failed
zh_hans: 规则格式未通过检验

source: Rule created; IP/GEO rules are evaluated at runtime by core DNS resolution.
zh_hans: 规则已创建，属于 IP/GEO 规则，在运行时依据核心 DNS 解析匹配。

source: No match found for simulated destination; please verify rule.
zh_hans: 未能匹配模拟目标，请检查规则配置。

source: Invalid simulated destination address.
zh_hans: 模拟目标地址格式不合法。

source: Custom rule added and active at top priority
zh_hans: 自定义规则已添加并置顶生效

source: Custom rule updated
zh_hans: 自定义规则已更新

source: Custom rule deleted
zh_hans: 自定义规则已删除

source: Open Connections for per-flow details. Route checks are shown separately below.
zh_hans: 在“连接”查看每条连接的详情。线路检查结果单独显示在下方。

source: Pause list
zh_hans: 暂停列表

source: Resume list
zh_hans: 恢复列表

source: Copy destination
zh_hans: 复制目标

source: Connection details
zh_hans: 连接详情

source: Snapshot captured when opened. Values do not refresh here.
zh_hans: 显示打开时的快照，此处数据不会自动刷新。

source: Rule payload
zh_hans: 规则内容

source: Outlet chain
zh_hans: 出口链路

source: List paused · session counters are live
zh_hans: 列表已暂停 · 会话统计仍实时更新

source: Shortcuts & Notifications
zh_hans: 快捷键与通知

source: Version & Updates
zh_hans: 版本与更新

source: Routing mode changes apply immediately when connected. Switching engines reconnects automatically. Network optimization applies on the next connection or profile reload.
zh_hans: 连接期间，路由模式立即生效；切换引擎会自动重连。网络优化在下一次连接或重新加载配置时生效。

source: Search profiles
zh_hans: 搜索配置

source: Bypass changes apply on the next connection. CIDR exclusions can bypass routing rules at the system layer.
zh_hans: 绕过规则在下一次连接时生效。CIDR 排除可在系统路由层绕过分流规则。

source: View routing rules
zh_hans: 查看路由规则

source: Rule sources & scope
zh_hans: 规则来源与作用范围

source: Custom rules take precedence in the core rule list. Imported rules retain their order; optimization may add direct rules at runtime.
zh_hans: 自定义规则在核心规则列表中优先匹配。导入规则保留原有顺序；网络优化可能在运行时添加直连规则。

source: This list is a configuration summary. System bypass exclusions and runtime optimization can affect actual traffic outside the displayed list.
zh_hans: 此列表是配置摘要。系统绕过排除与运行时网络优化也会影响实际流量，可能未包含在显示列表中。

source: Manage bypass rules
zh_hans: 管理绕过规则

source: Open Settings and select Bypass.
zh_hans: 打开设置并选择“绕过”。

source: Predicts a match against the displayed rules. This does not test reachability, DNS resolution, or the complete runtime policy.
zh_hans: 根据显示的规则预测匹配结果，不测试实际可达性、DNS 解析或完整运行时策略。

source: Advanced DNS details
zh_hans: 高级 DNS 详情

source: DNS changes apply on the next TUN connection, including restoring profile defaults.
zh_hans: DNS 修改在下一次 TUN 连接生效，包括恢复配置默认值。

source: Restore profile defaults
zh_hans: 恢复配置默认值

source: DNS behavior will follow the active profile on the next TUN connection.
zh_hans: 下一次 TUN 连接时，DNS 将遵循当前配置。

source: Route check incomplete
zh_hans: 线路检查未完成

source: Still connected. The route did not complete its checks within the time limit; target availability is not confirmed.
zh_hans: 连接仍保持。线路未在限定时间内完成检查，尚未确认目标可用性。

source: Last measurement
zh_hans: 最近测量

source: Older than 5 minutes · test again
zh_hans: 结果已超过 5 分钟 · 请重新测试

source: Proxy group
zh_hans: 策略组

source: View connections
zh_hans: 查看连接

source: Support report
zh_hans: 支持报告

source: The bundled notice file could not be verified. Reinstall AetherRoute or contact support.
zh_hans: 无法验证应用内的许可文件。请重新安装 AetherRoute 或联系支持。

source: Discard unsaved changes?
zh_hans: 放弃未保存的修改？

source: Discard Changes
zh_hans: 放弃修改

source: Keep Editing
zh_hans: 继续编辑

source: Undo removal
zh_hans: 撤销删除

source: Advanced connection options
zh_hans: 高级连接选项

source: Enter a node name.
zh_hans: 请输入节点名称。

source: Port must be between 1 and 65535.
zh_hans: 端口必须在 1 到 65535 之间。

source: Privacy details
zh_hans: 隐私详情

source: Updated
zh_hans: 更新于

source: Network Settings
zh_hans: 网络

source: Route not checked
zh_hans: 线路尚未检查

source: Syncing profiles…
zh_hans: 正在同步配置…

source: Enabled · no completed sync yet
zh_hans: 已开启 · 尚无完成的同步

source: Enabling sync does not confirm completion. Automatic sync merges profiles; review the result before using Force Pull or Force Push.
zh_hans: 开启同步不代表已经完成。自动同步会合并配置；使用强制拉取或推送前，请先检查同步结果。

source: Live Connectivity Diagnostics
zh_hans: 实时连接诊断

source: Real-time inspection of tunnel adapter, Fake-IP DNS, and outbound TLS path.
zh_hans: 实时检查隧道适配器、Fake-IP DNS 和出口 TLS 路径。

source: Inspect end-to-end network health or generate a bounded support report.
zh_hans: 检查端到端网络状态或生成限定范围的支持报告。

source: Run Diagnostics
zh_hans: 运行诊断

source: Re-run Diagnostics
zh_hans: 重新诊断

source: Diagnosing...
zh_hans: 诊断中…

source: Diagnose
zh_hans: 诊断

source: Run end-to-end network connectivity diagnostics.
zh_hans: 运行端到端网络连接诊断。

source: Tunnel & Node
zh_hans: 隧道与节点

source: Domestic Direct
zh_hans: 国内直连

source: Outbound Proxy Path
zh_hans: 代理出口路径

source: Inspecting tunnel adapter and active profile...
zh_hans: 正在检查隧道适配器和当前配置…

source: Testing Fake-IP pool (198.18.0.0/15) resolution...
zh_hans: 正在测试 Fake-IP 地址池（198.18.0.0/15）解析…

source: Probing domestic high-speed connectivity endpoint...
zh_hans: 正在探测国内连接检测端点…

source: Testing proxy node TCP connect and TLS handshake...
zh_hans: 正在测试代理节点 TCP 连接和 TLS 握手…

source: Pending
zh_hans: 等待检查

source: All Systems Operational
zh_hans: 全链路通畅

source: Proxy Latency Degraded
zh_hans: 代理节点延迟偏高

source: Proxy Connection Blocked
zh_hans: 代理节点连接受阻

source: Local Network Offline / Captive Portal
zh_hans: 本地网络断开 / 处于门户认证状态

source: Tunnel Disconnected
zh_hans: 代理隧道未开启

source: DNS Resolution Failed
zh_hans: DNS 解析超时或失败

source: Diagnosis Inconclusive
zh_hans: 诊断结论不确定

source: All network layers, Fake-IP resolution, domestic and outbound proxy tunnels are working properly.
zh_hans: 所有网络层、Fake-IP 解析、国内直连与出海代理隧道均工作正常。

source: Outbound proxy handshake latency is high. Consider switching to a lower latency node in Proxies.
zh_hans: 出海代理节点握手延迟偏高，建议在「节点选择」中切换到延迟更低的备用节点。

source: Direct domestic network is fine, but the outbound proxy node failed to respond. The node port may be blocked. Please switch to an alternate proxy node.
zh_hans: 国内直连正常，但出海代理节点无响应。当前节点可能已失效或端口受阻，建议在「节点选择」中切换备用节点。

source: Both direct and proxy targets failed. Please check your physical Wi-Fi/Ethernet or complete the public Wi-Fi login portal.
zh_hans: 国内直连与代理均未响应。请检查 Wi-Fi / 有线连接，或在浏览器中完成公共 Wi-Fi 强制门户登录。

source: AetherRoute tunnel is currently disconnected. Please turn on connection to enable protected routing.
zh_hans: AetherRoute 隧道当前处于未连接状态，请在主界面开启连接后再行体检。

source: DNS queries timed out or failed. Please check your DNS settings or toggle connection to refresh resolver.
zh_hans: DNS 查询超时或无法解析目标主机，请检查 DNS 设置或重新开关连接以刷新解析器。

source: Diagnostics finished with mixed results. Re-running diagnostics is recommended.
zh_hans: 诊断结果存在不确定项，建议重新执行一次体检。

source: Direct connection failed:
zh_hans: 直连失败：

source: Proxy probe failed:
zh_hans: 代理探测失败：

source: Resolution timeout or host not found
zh_hans: 解析超时或未找到主机

source: Tunnel inactive
zh_hans: 隧道未启用

source: Tunnel connecting...
zh_hans: 隧道连接中…

source: Auto (Strategy Group)
zh_hans: 自动（策略组）

source: Activate AetherRoute in Settings > License & Updates before connecting.
zh_hans: 请先在“设置”>“许可证与更新”中激活 AetherRoute，再建立连接。

source: The saved license cannot authorize a connection. Review Settings > License & Updates.
zh_hans: 已保存的授权无法允许连接。请检查“设置”>“许可证与更新”。

source: The saved license cannot be verified. Review Settings > License & Updates.
zh_hans: 无法验证已保存的授权。请检查“设置”>“许可证与更新”。

source: The saved license has expired. Review Settings > License & Updates.
zh_hans: 已保存的授权已过期。请检查“设置”>“许可证与更新”。

source: The saved license was revoked. Review Settings > License & Updates.
zh_hans: 已保存的授权已被撤销。请检查“设置”>“许可证与更新”。

source: This license reached its device limit. Review Settings > License & Updates.
zh_hans: 此授权已达到设备数量上限。请检查“设置”>“许可证与更新”。

source: Bypass changes apply on the next connection. Network optimization applies on the next connection or profile reload.
zh_hans: 绕过设置在下次连接时生效。网络优化在下次连接或重新加载配置时生效。

source: Could not save the node. Check the configuration and try again.
zh_hans: 无法保存节点。请检查配置后重试。

source: The tunnel is connected. AetherRoute is checking the selected route in the background.
zh_hans: 隧道已连接。AetherRoute 正在后台检查当前线路。

source: Could not save the profile. Try again.
zh_hans: 无法保存配置，请重试。

source: Collecting traffic samples…
zh_hans: 正在收集流量数据…

source: Paused while AetherRoute is in the background · updated %@
zh_hans: AetherRoute 在后台时暂停刷新 · 更新于 %@

source: Paused while AetherRoute is in the background
zh_hans: AetherRoute 在后台时暂停刷新

source: Connected
zh_hans: 已连接

source: Needs approval
zh_hans: 等待批准

source: Switching
zh_hans: 正在切换

source: Clear
zh_hans: 清除

source: Connected for %@
zh_hans: 已连接 %@

source: Search actions, pages and nodes
zh_hans: 搜索操作、页面和节点

source: No matching commands
zh_hans: 没有匹配的命令

source: Select
zh_hans: 选择

source: Run
zh_hans: 执行

source: Close
zh_hans: 关闭

source: Actions
zh_hans: 操作

source: Pages
zh_hans: 页面

source: Current
zh_hans: 当前

source: Command Palette…
zh_hans: 命令面板…

source: Latency: %@
zh_hans: 延迟：%@

source: Tests this node again
zh_hans: 点按重新测速

source: Node inventory & providers
zh_hans: 节点清单与提供方

source: For troubleshooting subscription parsing or protocol support.
zh_hans: 排查订阅解析或协议支持问题时使用

source: Open-Source Licenses
zh_hans: 开源许可

source: Automatic checks are off. Updates are cryptographically signed with Ed25519.
zh_hans: 自动检查已关闭。更新由 Ed25519 密码学签名保护。

source: This edition does not contact a licensing service. Every software update is verified before it is installed.
zh_hans: 当前版本无需激活许可服务。每次软件更新在安装前都会经过验证。

source: Privacy & Diagnostics
zh_hans: 隐私与诊断

source: Download and Save
zh_hans: 下载并保存

source: Selected
zh_hans: 已选择

source: Form
zh_hans: 表单

source: Clash Rule Text
zh_hans: Clash 规则文本

source: Direct (DIRECT)
zh_hans: 直连 (DIRECT)

source: Reject (REJECT)
zh_hans: 拒绝 (REJECT)

source: Proxy node or group
zh_hans: 代理节点或策略组

source: Input mode
zh_hans: 输入方式

source: Match
zh_hans: 匹配内容

source: Match by IP without DNS lookup (no-resolve)
zh_hans: 不解析域名，直接按 IP 匹配 (no-resolve)

source: Action
zh_hans: 动作

source: Node or group
zh_hans: 节点或策略组

source: Note
zh_hans: 备注

source: Optional, e.g. Tailscale node / local service
zh_hans: 可选，例如 Tailscale 内网节点 / 本地服务

source: Optional, e.g. Direct private subnet
zh_hans: 可选，例如私有网段直连

source: e.g. example.com
zh_hans: 例如 example.com

source: e.g. my.server.com
zh_hans: 例如 my.server.com

source: e.g. tailscale or internal
zh_hans: 例如 tailscale 或 internal

source: e.g. 100.64.0.0/10 or 192.168.1.0/24
zh_hans: 例如 100.64.0.0/10 或 192.168.1.0/24

source: e.g. fd7a:115c:a1e0::/48
zh_hans: 例如 fd7a:115c:a1e0::/48

source: e.g. CN or US
zh_hans: 例如 CN 或 US

source: No Nodes
zh_hans: 暂无节点

source: Add a node to route traffic through this profile.
zh_hans: 添加节点后，即可通过此配置转发流量。

source: Add at least one node.
zh_hans: 请至少添加一个节点。

source: A native profile supports at most %lld nodes.
zh_hans: 原生配置最多支持 %lld 个节点。

source: Node names must be unique.
zh_hans: 节点名称不能重复。

source: A node name conflicts with a reserved routing name.
zh_hans: 节点名称与保留的路由名称冲突。

source: Route
zh_hans: 路由

source: New version %@
zh_hans: 新版本 %@

source: View and install the update
zh_hans: 查看并安装更新

source: Update available
zh_hans: 有可用更新

source: Permission to add the configuration was not given. Choose Retry, then Allow in the dialog.
zh_hans: 未获得添加配置的授权。请点按“重试”，然后在弹出的对话框中选择“允许”。

source: Step 2 of 2
zh_hans: 第 2 步，共 2 步

source: Set Up Network Permissions
zh_hans: 设置网络权限

source: AetherRoute needs two macOS permissions for each network engine. Grant them once now, and connecting or switching engines later will never stop for a prompt.
zh_hans: 每个网络引擎都需要两项 macOS 授权。现在一次性完成，之后连接或切换引擎都不会再被弹窗打断。

source: Later
zh_hans: 稍后

source: Start Setup
zh_hans: 开始配置

source: Waiting for Permission…
zh_hans: 正在等待授权…

source: Start Using AetherRoute
zh_hans: 开始使用 AetherRoute

source: Restart to Continue
zh_hans: 重启后继续

source: Nothing connects during setup. AetherRoute only asks macOS for permission.
zh_hans: 配置过程中不会建立任何连接，只向 macOS 申请授权。

source: macOS finishes installing the extension after a restart. Open AetherRoute again afterwards to continue.
zh_hans: macOS 需要重启后才能完成扩展安装。重启后再次打开 AetherRoute 即可继续。

source: %@ is not available on this Mac. You can still use the other engine.
zh_hans: %@ 在这台 Mac 上不可用，你仍可使用另一个引擎。

source: In System Settings › General › Login Items & Extensions › Network Extensions, switch on AetherRoute.
zh_hans: 请在“系统设置 › 通用 › 登录项与扩展 › 网络扩展”中打开 AetherRoute。

source: Choose Allow when macOS asks to add the AetherRoute configuration.
zh_hans: macOS 询问是否添加 AetherRoute 配置时，请选择“允许”。

source: Available after this Mac restarts.
zh_hans: 重启这台 Mac 后可用。

source: Checking
zh_hans: 正在检查

source: Not set up
zh_hans: 未配置

source: Installing
zh_hans: 正在安装

source: Waiting for you
zh_hans: 等待你操作

source: Ready
zh_hans: 已就绪

source: Restart needed
zh_hans: 需要重启

source: Not finished
zh_hans: 未完成

source: What you will be asked
zh_hans: 你需要完成的两步

source: Switch on the network extensions
zh_hans: 打开网络扩展开关

source: Allow the configurations
zh_hans: 允许添加配置

source: macOS opens Login Items & Extensions. Under Network Extensions, switch on both AetherRoute entries. You may need your password or Touch ID.
zh_hans: macOS 会打开“登录项与扩展”。在“网络扩展”中打开两个 AetherRoute 开关，可能需要输入密码或使用触控 ID。

source: macOS asks whether AetherRoute may add proxy and VPN configurations. Choose Allow for each.
zh_hans: macOS 会询问是否允许 AetherRoute 添加代理与 VPN 配置，每次都请选择“允许”。

source: Network setup required
zh_hans: 需要完成网络设置

source: Finish granting the network permissions in the main window before connecting.
zh_hans: 请先在主窗口完成网络权限设置，再进行连接。

source: Continue Setup
zh_hans: 继续设置

source: Set Up Permissions Again
zh_hans: 重新设置权限

source: What the report contains
zh_hans: 报告包含的内容

source: Privacy disclosure
zh_hans: 隐私说明

source: Accepted on this Mac
zh_hans: 已在此 Mac 上接受

source: Not accepted
zh_hans: 尚未接受

source: Custom rules
zh_hans: 自定义规则

source: Add another profile
zh_hans: 添加更多配置

source: Test Latency
zh_hans: 测速

source: Test this node again
zh_hans: 重新测速此节点

source: No profile yet
zh_hans: 尚未导入配置

source: Import a profile or add a subscription to connect.
zh_hans: 导入配置或添加订阅后即可连接。

source: Add Profile
zh_hans: 添加配置

source: Could not connect
zh_hans: 连接失败

source: Details
zh_hans: 查看详情

source: Takes over each app's connections. Most compatible; recommended for everyday use.
zh_hans: 按应用接管网络连接，兼容性最好，推荐日常使用。

source: Captures all traffic through a virtual network interface and can offer a local proxy for Terminal.
zh_hans: 通过虚拟网卡接管全部流量，可为终端提供本地代理。

source: Transparent Proxy or TUN?
zh_hans: 透明代理还是 TUN？

source: Transparent Proxy · recommended for most people
zh_hans: 透明代理 · 推荐大多数人使用

source: Takes over each app's network connections. The simplest choice.
zh_hans: 按应用接管网络连接，最省心。

source: Works more easily alongside a company VPN, Tailscale and other network tools.
zh_hans: 和公司 VPN、Tailscale 等其他网络工具更容易同时使用。

source: Bypass rules can use domains and IP ranges.
zh_hans: 绕过规则支持域名和 IP 网段。

source: No local proxy port, so exporting a proxy in Terminal does not work.
zh_hans: 不提供本地代理端口，终端里 export 代理用不了。

source: DNS page overrides do not apply; the system DNS is used.
zh_hans: DNS 页的覆盖设置不生效，使用系统 DNS。

source: TUN · when you need to capture all traffic
zh_hans: TUN · 需要接管全部流量时用

source: Creates a virtual network interface and captures this Mac's IPv4 and IPv6 traffic at the network layer.
zh_hans: 创建虚拟网卡，在网络层接管这台 Mac 的 IPv4 与 IPv6 流量。

source: Can offer a local HTTP / SOCKS proxy (127.0.0.1:7890) for Terminal and developer tools.
zh_hans: 可开启本地 HTTP / SOCKS 代理（127.0.0.1:7890），终端和开发工具可直接使用。

source: DNS behaviour, such as Fake-IP, can be adjusted on the DNS page.
zh_hans: 可在 DNS 页调整解析方式（如 Fake-IP）。

source: Bypass rules use IP ranges only, not domains.
zh_hans: 绕过规则只支持 IP 网段，不支持域名。

source: With other software that also uses a virtual interface, such as Tailscale, domain names may fail to resolve.
zh_hans: 与 Tailscale 等同样使用虚拟网卡的软件同时开启时，可能出现无法解析域名。

source: How to choose
zh_hans: 怎么选
